Revit 2027 API
RebarUpdateCurvesData.IsEndConstraintChanged Property
 Indicates if the end handle constraint has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEndConstraintChanged { get; }
Public ReadOnly Property IsEndConstraintChanged As Boolean
	Get
public:
property bool IsEndConstraintChanged {
	bool get ();
}
member IsEndConstraintChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace